clear
close all
clc
load start_end.mat;
y=start_endlocation(:,:,1);
y=y(:,1);
x=start_endlocation(:,:,2);
x=x(:,2);
loc=[x y];
xlswrite('早高峰出发到达对应表.xlsx',loc);

%%
clc
clear
close all
go=[116.191	39.9213
116.265	39.9074
116.307	39.9614
116.377	39.9754
116.346	39.9092
116.417	39.9875
116.440 39.9599
116.508	39.9153
116.460 39.8819
116.404	39.8560 ];
geoscatter(go(:,2),go(:,1),'red');
hold on
arr=[116.1852264	39.92225647
116.2607574	39.91539001
116.3156891	39.95246887
116.4008331	39.97306824
116.3665009	39.91264343
116.4241791	39.98542786
116.4324188	39.95521545
116.5161896	39.92225647
116.4613 	39.9168 
116.4008 	39.8536 ];
x=arr(:,1);
y=arr(:,2);
geoscatter(y,x,'blue');
hold on
legend('出发','到达')
title('test集 早高峰热门出发地及其到达地预测')